function dy = fun_orbit(t,y)
% 
global r_p r_a i_orb Rz Rz_ekv mu_z w_z w_s eb_ nu_ I I_1 H w_orb J_2 dUT;      % Глобальные переменные для расчета орбиты и параметры спутника
%
% Rz = 6371000.;                                      % m         % Средний радиус Земли
% Rz_ekv = 6378000.;                                  % m         % Радиус Земли на экваторе
% mu_z = 0.3986*10^15;                                % m^3/c^2   % Гравитационная постоянная Земли
% w_z = 7.292115854937194e-005;                                % c^-1      % Угловая скорость суточного вращения Земли 
% J_2 = 1.0826347*10^-3;                               % -         % коэффициент при второй гармонике разложения геопотенциала в ряд Гаусса
% 
dy = zeros(7,1); % a column vector
% -----------------------------------------------------------------------
% ---------- РАСЧЕТ ПАРАМЕТРОВ ОРБИТАЛЬНОГО ДВИЖЕНИЯ (ТОЧНЫЙ МЕТОД) -----
% -----------------------------------------------------------------------
gama_ = y(1);
% Vx_g = y(2);
% Vy_g = y(3);
% Vz_g = y(4);
% x_g = y(5);
% y_g = y(6);
% z_g = y(7);
x_g = y(2)*0.001;
y_g = y(3)*0.001;
z_g = y(4)*0.001;
Vx_g = y(5)*0.001;
Vy_g = y(6)*0.001;
Vz_g = y(7)*0.001;
r_g = (x_g^2. + y_g^2. + z_g^2.)^0.5;
C_fi = y_g/r_g;
A = ((mu_z*10^(-9.))/r_g^3.)*(0.5*((Rz_ekv/1000/r_g)^2.)*(15.*C_fi^2.-3.)*J_2 - 1.);
B = 3.*((mu_z*10^(-9.))/r_g^2.)*((Rz_ekv/1000/r_g)^2.)*J_2*C_fi;
% dy(1) = w_z;
% dy(2) = A*x_g - 2.*w_z*Vz_g + w_z^2.*x_g;
% dy(3) = A*y_g - B;
% dy(4) = A*z_g + 2.*w_z*Vx_g + w_z^2.*z_g;
% dy(5) = Vx_g;
% dy(6) = Vy_g;
% dy(7) = Vz_g;
dy(1) = w_z;
dy(2) = Vx_g*1000.;
dy(3) = Vy_g*1000.;
dy(4) = Vz_g*1000.;
dy(5) = (A*x_g - 2.*w_z*Vz_g + w_z^2.*x_g)*1000.;
dy(6) = (A*y_g - B)*1000.;
dy(7) = (A*z_g + 2.*w_z*Vx_g + w_z^2.*z_g)*1000.;
% -----------------------------------------------------------------------
% ---- КОНЕЦ РАСЧЕТА ПАРАМЕТРОВ ОРБИТАЛЬНОГО ДВИЖЕНИЯ (ТОЧНЫЙ МЕТОД) ----
% -----------------------------------------------------------------------
end