% -----------------------------------------------------------------------
% ---------------- Begin Функция вычисления матрицы поворота ------------
% -----------------------------------------------------------------------
function XYZ_u = XYZ_u_(a, e, i, G, wp, u, v) % Begin function XYZ_u_(a, e, i, G, wp, u, v) %
% Функция позволяет вычислить параметры орбиты в прямоугольной системе
% координа ИСК используя параметры орбиты в ОСК
% Исходные данные:
% a - [km] большая полуось,
% e - [-] эксцентриситет,
% i - [rad] наклонение орбиты, 
% G - [rad] Долгота восходящего узла, 
% wp - [rad] Аргумент перигея,
% u - [rad] Аргумент широты, 
% v - [rad] Истиная аномалия,
% 
mu_z = 0.3986*10^15;                                % m^3/c^2   % Гравитационная постоянная Земли
%
p = a*(1-e^2);
r = p/(1+e*cos(v));
Vr = (((mu_z*10^(-9.))/p)^0.5)*e*sin(v);
Vn = (((mu_z*10^(-9.))/p)^0.5)*(1+e*cos(v));
%
a_x = cos(u)*sin(G)+sin(u)*cos(G)*cos(i);
a_y = sin(u)*sin(i);
a_z = cos(u)*cos(G)-sin(u)*sin(G)*cos(i);
Vx = Vr*a_x - Vn*(sin(u)*sin(G)-cos(u)*cos(G)*cos(i));
Vy = Vr*a_y + Vn*cos(u)*sin(i);
Vz = Vr*a_z - Vn*(sin(u)*cos(G)+cos(u)*sin(G)*cos(i));
X = r*a_x;
Y = r*a_y;
Z = r*a_z;
XYZ_u = [Vx, Vy, Vz, X, Y, Z];
%
% end                     % End function XYZ_u_(a, e, i, G, wp, u, v) %
% -----------------------------------------------------------------------
% ---------------- End Функция вычисления матрицы поворота --------------
% -----------------------------------------------------------------------
