% -----------------------------------------------------------------------
% ------------- Begin ‘ункци€ вычислени€ производной матрицы поворота ---
% -----------------------------------------------------------------------
function T_x_dt = T_dt(i,xx) % Begin function T_dt(i,xx) %
% ‘ункци€ позвол€ет вычислить производную матрицу поворота вокруг заданной оси на
% заданный угол без произвидени€ производной угла поворота.
% »сходные данные:
% i - номер оси, может принимать три значени€:
%       1 - поворот вокруг оси X,
%       2 - поворот вокруг оси Y,
%       3 - поворот вокруг оси Z;
% xx - значение угла на который необходимо повернуть, rad.
    if i == 1                                           % ѕоворот вокруг оси X
        T_x_dt = [ 0,        0,        0;
                   0, -sin(xx),  cos(xx);
                   0, -cos(xx), -sin(xx);];                 % –асчетна€ матрица
    end
    if i == 2                                           % ѕоворот вокруг оси Y
        T_x_dt = [-sin(xx), 0, -cos(xx);
                         0, 0,        0;
                   cos(xx), 0, -sin(xx);];                  % –асчетна€ матрица
    end
    if i == 3                                           % ѕоворот вокруг оси Z
        T_x_dt = [-sin(xx),  cos(xx), 0;
                  -cos(xx), -sin(xx), 0;
                         0,        0, 0;];                   % –асчетна€ матрица
    end
% end                     % End funktion T_dt(i,xx) %
% -----------------------------------------------------------------------
% ------------- End ‘ункци€ вычислени€ производной матрицы поворота -----
% -----------------------------------------------------------------------
